app/Controllers/AuthController.php

    public function register()
    {
        // Load the UserModel
        $userModel = new UserModel();

        // Get form input directly
        $userData = [
            "user_name" => $this->request->getPost("username"),
            "email" => $this->request->getPost("email"),
            "phone" => $this->request->getPost("phone"),
            "password" => password_hash(
                $this->request->getPost("password"),
                PASSWORD_DEFAULT
            ), // Hash the password
        ];

        // Insert data into the database (no validation)
        $userModel->insert($userData);

        // Check if any rows were affected
        if ($userModel->db->affectedRows() > 0) {

            $insertedUserId = $userModel->getInsertID();

        // Fetch the newly created user data
        $user = $userModel->find($insertedUserId);
---
INSERT INTO `users` (`user_name`, `email`, `phone`, `password`, `created_date`, `updated_at`) VALUES ('sneha@gmail.com', 'snehaav@gmail.com', '9999999999', '$2y$10$XGULF8N5mKe.EzqOTnE2ROMg0zGDrP/nIYVdYmpJgTlZkoLfeooVW', '2024-11-11 19:33:52', '2024-11-11 19:33:52')
SELECT *
FROM `users`
WHERE `users`.`user_id` = 9