app/Controllers/BusinessController.php

SELECT *
FROM `manufacturer_products`
WHERE `user_id` = '7'
---
    public function BusinessHome()
    {
        // Use the authenticate method to check the session and get user data
        $user = $this->authenticate();

        // Check if the user's KYC is verified
        $isKycVerified = $user['kyc_verify'];

        // Load the ProductModel
        $model = new ManufacturerProductModel();

        // Fetch all products
        $userId = $user['user_id'];
        $data['products'] = $model->where('user_id', $userId)->findAll();

SELECT *
FROM `kyc_verifications`
WHERE `user_id` = '6'
 LIMIT 1
---
    public function BusinessVerification()
    {
        // Use the authenticate method to check the session and get user data
        $user = $this->authenticate();
        $userId = $user['user_id'];

        // Load the KYC Verification Model
        $model = new \App\Models\KycVerificationModel();

        // Check if the KYC verification has already been submitted by the user
        $kycExists = $model->where('user_id', $userId)->first();

SELECT *
FROM `users`
WHERE `user_id` = '6'
 LIMIT 1
---
    private function getAuthenticatedUser()
    {
        // Get the user_id from the session
        $user_id = session()->get('user_id');

        // If no user_id is found in the session, return null
        if (!$user_id) {
            return null;
        }

        // Load the UserModel
        $userModel = new UserModel();

        // Fetch the user's information from the database
        $user = $userModel->where('user_id', $user_id)->first();

SELECT *
FROM `users`
WHERE `user_id` = '6'
 LIMIT 1
---
    public function chooseUserType()
    {
        // Get the user ID from session or request
        $userId = session()->get('user_id'); // Assuming user_id is stored in session after login

        if ($this->request->getMethod() === 'post') {
            // Get the selected user type from the form submission
            $userType = $this->request->getPost('user_type');

            // Ensure the userType is valid
            $validTypes = ['Agent', 'Agency', 'Manufacturer', 'Distributor', 'Supplier', 'Franchise'];
            if (!in_array($userType, $validTypes)) {
                return redirect()->back()->with('error', 'Invalid user type selected.');
            }

            // Update the user_type field for the specific user
            $userModel = new UserModel();

            // Only update the user_type for the specific user
            $userModel->update($userId, [
                'user_type' => $userType
            ]);

            // Redirect to the business home page with success message
            return redirect()->to('/business_home')->with('success', 'User type updated successfully.');