app/Controllers/PartnerController.php

SELECT *
FROM `transactions`
---
    public function partnerHome()
    {
        if (!$this->checkSession()) {
            return redirect()->to('/customer_login');
        }
        $model = new TransactionModel();
        $data['transactions'] = $model->findAll();