app/Controllers/PartnerController.php

    public function partnerHome(): ResponseInterface
    {
        if (!$this->checkSession()) {
            return redirect()->to('/customer_login');
        }

        $data = [
            'transactions' => (new TransactionModel())->findAll(),
            'market_previews' => (new MarketModel())->getMarketPreview(),
            'trending_products' => (new ProductModel())->getTrendingBrands(),
        ];
---
SELECT *
FROM `market_previews`

    public function productDetails(): ResponseInterface
    {
        if (!$this->checkSession()) {
            return redirect()->to('/customer_login');
        }
        $data['product_data'] = (new ProductModel())->findAll();
---
SELECT *
FROM `product_data`