app/Controllers/TransactionController.php

        ];

        // Attempt to insert the data and log any errors if insertion fails
        if ($transactionModel->insert($data)) {
---
INSERT INTO `transactions` (`user_id`, `amount`, `payment_id`, `name`, `email`, `status`, `created_at`) VALUES (2, '6000', 'pay_PBlFTAqhWKu56S', 'arjunreddy', 'demo@gmail.com', 'success', '2024-10-21 16:55:13')