app/Models/UserModel.php

    public function get_user_by_token($token)
    {
        return $this->db->table('users') // Use table() to specify the table
        ->where('reset_token', $token) // Add your condition
        ->get() // Execute the query
        ->getRow(); // Fetch a single row
---
SELECT *
FROM `users`
WHERE `reset_token` = '146a0f729bf23fa0db652d5c7f6059ab47dd9ee3546982dec7b39c69410018824b498005c773235e16a24de0eebb4add251c'